; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v3 - type_1 ?v6 - type_2)
 	      (pred_4 ?v1 - object ?v6 - type_2)
	      (pred_1 ?v3 - type_1 ?v4 - type_3)
	      (pred_3 ?v3 - type_1 ?v1 - object ?v4 - type_3))

   (:action op_1
       :parameters  (?v3 - type_1 ?v5 ?v7 - type_2)
       :precondition (and  (pred_2 ?v3 ?v5))
       :effect (and  (pred_2 ?v3 ?v7)
		     (not (pred_2 ?v3 ?v5))))

   (:action op_2
       :parameters (?v3 - type_1 ?v2 - object ?v8 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v8) (pred_2 ?v3 ?v8) (pred_1 ?v3 ?v4))
       :effect (and (pred_3 ?v3 ?v2 ?v4)
		    (not (pred_4 ?v2 ?v8)) 
		    (not (pred_1 ?v3 ?v4))))

   (:action op_3
       :parameters (?v3 - type_1 ?v2 - object ?v8 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v2 ?v4) (pred_2 ?v3 ?v8))
       :effect (and (pred_4 ?v2 ?v8)
		    (pred_1 ?v3 ?v4)
		    (not (pred_3 ?v3 ?v2 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_14 obj_13 - type_1
obj_06 obj_01 obj_08 obj_11 - type_3
obj_05 obj_02 obj_07 obj_09 - type_2
obj_04 obj_03 obj_12 obj_10 - object)
(:init
(pred_2 obj_14 obj_02)
(pred_1 obj_14 obj_06)
(pred_1 obj_14 obj_01)
(pred_2 obj_13 obj_09)
(pred_1 obj_13 obj_08)
(pred_1 obj_13 obj_11)
(pred_4 obj_04 obj_07)
(pred_4 obj_03 obj_02)
(pred_4 obj_12 obj_02)
(pred_4 obj_10 obj_09)
)
(:goal
(and
(pred_4 obj_04 obj_07)
(pred_4 obj_03 obj_05)
(pred_4 obj_12 obj_09)
(pred_4 obj_10 obj_09)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_14 obj_09) (pred_2 obj_13 obj_09))))
  )
)
)

; plan
1. (op_2 obj_14 obj_03 obj_02 obj_01)
   deleted: (pred_4 obj_03 obj_02) (pred_1 obj_14 obj_01)
   added: (pred_3 obj_14 obj_03 obj_01)
   goals met: 2 of 4
2. (op_2 obj_14 obj_12 obj_02 obj_06)
   deleted: (pred_4 obj_12 obj_02) (pred_1 obj_14 obj_06)
   added: (pred_3 obj_14 obj_12 obj_06)
   goals met: 2 of 4
3. (op_1 obj_13 obj_09 obj_05)
   deleted: (pred_2 obj_13 obj_09)
   added: (pred_2 obj_13 obj_05)
   goals met: 2 of 4
4. (op_1 obj_14 obj_02 obj_05)
   deleted: (pred_2 obj_14 obj_02)
   added: (pred_2 obj_14 obj_05)
   goals met: 2 of 4
5. (op_3 obj_14 obj_03 obj_05 obj_01)
   deleted: (pred_3 obj_14 obj_03 obj_01)
   added: (pred_4 obj_03 obj_05) (pred_1 obj_14 obj_01)
   goals met: 3 of 4
6. (op_1 obj_14 obj_05 obj_09)
   deleted: (pred_2 obj_14 obj_05)
   added: (pred_2 obj_14 obj_09)
   goals met: 3 of 4
7. (op_3 obj_14 obj_12 obj_09 obj_06)
   deleted: (pred_3 obj_14 obj_12 obj_06)
   added: (pred_4 obj_12 obj_09) (pred_1 obj_14 obj_06)
   goals met: 4 of 4
